app/controllers/api/v1/divisions_controller.rb

INSERT INTO "divisions" ("name", "game_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "AIAAA DIvision 3"], ["game_id", 1], ["created_at", "2022-08-20 10:22:30.536771"], ["updated_at", "2022-08-20 10:22:30.536771"], ["user_id", 5]]
---
  def create
    @division = Division.new(division_params.merge(game: @game, user: @user))
    if @division.save

UPDATE "divisions" SET "name" = ?, "updated_at" = ? WHERE "divisions"."id" = ?  [["name", "Premiere League"], ["updated_at", "2022-08-18 07:33:37.510984"], ["id", 2]]
---
  def update
    if @division.update(division_params)

DELETE FROM "divisions" WHERE "divisions"."id" = ?  [["id", 1]]
---
  def destroy
    @division.destroy

SELECT "divisions".* FROM "divisions" WHERE "divisions"."user_id" = ? AND "divisions"."id" = ? LIMIT ?  [["user_id", 5], ["id", 4], ["LIMIT", 1]]
---
  def set_division
    # @division = @user.divisions.find_by!(id: params[:id]) if @game
    puts "Is admin:: #{is_admin}"
    @division = is_admin ? Division.find(params[:id]) : @user.divisions.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 5], ["id", 1], ["LIMIT", 1]]
---
  def set_game
    @game = is_admin ? Game.find(params[:game_id]) : @user.games.find(params[:game_id])