app/controllers/api/v1/divisions_controller.rb

SELECT "divisions".* FROM "divisions" WHERE "divisions"."game_id" = ? AND "divisions"."id" = ? LIMIT ?  [["game_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_division
    @division = @game.divisions.find_by!(id: params[:id]) if @game