app/controllers/api/v1/games_controller.rb

  def index
    games = is_admin ? Game.order('created_at DESC') : @user.games
---
SELECT "games".* FROM "games" ORDER BY created_at DESC

  def create
    @game = Game.new(game_params.merge(user: @user))
    if @game.save
---
INSERT INTO "games" ("name", "governingBody", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Game AIAAA"], ["governingBody", "AIAA"], ["created_at", "2022-08-20 10:11:18.726910"], ["updated_at", "2022-08-20 10:11:18.726910"], ["user_id", 5]]

  def update
    if @game.update(game_params)
---
UPDATE "games" SET "name" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["name", "Cricket Updatsss"], ["updated_at", "2022-08-18 07:05:28.527059"], ["id", 1]]

  def set_game
    @game = is_admin ? Game.find(params[:id]) : @user.games.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 6], ["id", 1], ["LIMIT", 1]]