app/controllers/api/v1/teams_controller.rb

  def create
    @team = Team.new(team_params.merge(division: @division, user: @user))

    if @team.save
---
INSERT INTO "teams" ("name", "division_id", "managerName", "managerContact", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Team 1"], ["division_id", 1], ["managerName", "A"], ["managerContact", "B"], ["created_at", "2022-08-20 10:29:28.892248"], ["updated_at", "2022-08-20 10:29:28.892248"], ["user_id", 5]]

  def update
    if @team.update(team_params)
---
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Team Update"], ["updated_at", "2022-08-18 07:53:08.476389"], ["id", 1]]

  def destroy
    @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]

  def set_team
    @team = @division.teams.find_by!(id: params[:id]) if @division
---
SELECT "teams".* FROM "teams" WHERE "teams"."division_id" = ? AND "teams"."id" = ? LIMIT ?  [["division_id", 1], ["id", 1], ["LIMIT", 1]]

  def set_division
    #have doubt on find
    @division = @game.divisions.find(params[:division_id]) if @game
---
SELECT "divisions".* FROM "divisions" WHERE "divisions"."game_id" = ? AND "divisions"."id" = ? LIMIT ?  [["game_id", 1], ["id", 1], ["LIMIT", 1]]

  def set_game
    @game = is_admin ? Game.find(params[:game_id]) : @user.games.find(params[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = ? AND "games"."id" = ? LIMIT ?  [["user_id", 5], ["id", 1], ["LIMIT", 1]]