app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?)  [["username", "normalUser2"], ["password_digest", "[FILTERED]"], ["created_at", "2022-08-20 08:55:34.268879"], ["updated_at", "2022-08-20 08:55:34.268879"], ["user_type", "regular"]]
---
  def create
    @user = User.create(user_params)