app/controllers/application_controller.rb

  def authorized_user
    decoded_token = decode_token()
    if decoded_token
      user_id = decode_token[0]['user_id']
      @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]